Repository: searxng/searxng
Catalog: searx/translations/*/LC_MESSAGES/messages.po
Languages: tt

source: without further subgrouping
tt: төркемләшер киләсе бүлүдән башка

source: other
tt: башка

source: files
tt: файллар

source: general
tt: гомуми

source: music
tt: моң

source: social media
tt: социаль челтәрләр

source: images
tt: сурәтләр

source: videos
tt: видео

source: radio
tt: радио

source: tv
tt: ТВ

source: it
tt: МТ

source: news
tt: яңалыклар

source: map
tt: хариталар

source: onions
tt: .onion

source: science
tt: фән

source: apps
tt: кушымталар

source: dictionaries
tt: сүзлекләр

source: lyrics
tt: җыр текстлары

source: packages
tt: пакетлар

source: q&a
tt: сораулар вә җаваплар

source: repos
tt: сакланмалар (репозиторилар)

source: software wikis
tt: програм викисы

source: web
tt: веб

source: scientific publications
tt: фәнни басмалар

source: auto
tt: автоматик

source: light
tt: ак

source: dark
tt: караңгы

source: black
tt: кара

source: Uptime
tt: Эш вакыты

source: About
tt: Програм турында

source: Average temp.
tt: Уртача темперура

source: Cloud cover
tt: болытлылык

source: Condition
tt: шартлар

source: Current condition
tt: Хәзерге шартлар

source: Evening
tt: Кич

source: Feels like
tt: Сизелә:

source: Humidity
tt: Дымлылык

source: Max temp.
tt: Чик темп.

source: Min temp.
tt: Мин. темп.

source: Morning
tt: Иртә

source: Night
tt: Төн

source: Noon
tt: Төш

source: Pressure
tt: Басым

source: Sunrise
tt: Кояш чыгу

source: Sunset
tt: Кояш баю

source: Temperature
tt: Температура

source: UV index
tt: УШ индексы

source: Visibility
tt: Күренүчәнлек

source: Wind
tt: Җил

source: subscribers
tt: язылучы

source: posts
tt: язма

source: active users
tt: актив кулланучы

source: user
tt: кулланучы

source: community
tt: берләшмә

source: points
tt: нокта

source: title
tt: исем

source: author
tt: автор

source: open
tt: ачык

source: closed
tt: ябык

source: No item found
tt: Нәтиҗә табылмады

source: Source
tt: Чыганак

source: Invalid settings, please edit your preferences
tt: Хаталы көйләүләр; сезнең көйләүләрне үзгәртегезче

source: Invalid settings
tt: Хаталы көйләүләр

source: search error
tt: эзләү хатасы

source: timeout
tt: вакыт бетте

source: parsing error
tt: тану хатасы

source: HTTP protocol error
tt: HTTP протоколының хатасы

source: network error
tt: челтәр хатасы

source: SSL error: certificate validation has failed
tt: SSL хатасы: сертификатны тикшереп булмады

source: unexpected crash
tt: көтмәгән сафтан чыгу

source: HTTP error
tt: HTTP хатасы

source: HTTP connection error
tt: HTTP тоташу хатасы

source: proxy error
tt: прокси хатасы

source: too many requests
tt: артык күп сораулар

source: access denied
tt: рөхсәт тыелган

source: server API error
tt: сервер API'ының хатасы

source: Suspended
tt: Туктатылды

source: {minutes} minute(s) ago
tt: {minutes} минут элек

source: {hours} hour(s), {minutes} minute(s) ago
tt: {hours} сәгать, {minutes} минут элек

source: Random value generator
tt: Очраклы кыйммәт генераторы

source: Generate different random values
tt: Төрле очраклы кыйммәтләрне чыгара

source: Statistics functions
tt: Статистик функцияләр

source: Compute {functions} of the arguments
tt: Аргументлар {functions} функцияләрен санала

source: Synonyms
tt: Синонимнар

source: Get directions
tt: Юнәлешләрне сорау

source: {title} (OBSOLETE)
tt: {title} (ИСКЕРГӘН)

source: Channel
tt: Канал

source: bitrate
tt: битрейт

source: votes
tt: тавыш

source: clicks
tt: басу саны

source: Language
tt: Тел

source: The image could not be downloaded.
tt: Сурәтне йөкләнеп булмады.

source: Book rating
tt: Китап билгесе

source: File quality
tt: Файл сыйфаты

source: Self Information
tt: Үз турында мәгълүмат

source: Displays your IP if the query is "ip" and your user agent if the query contains "user agent".
tt: Әгәр «ip» соравы булса, сезнең IP адресын күрсәтә. Әгәр «user agent» соравы булса, сезнең браузер турында мәгълүматны күрсәтә.

source: Your IP is:
tt: Сезнең IP адресы:

source: Your user-agent is:
tt: Сезнең браузер турында мәгълүмат:

source: Tor check plugin
tt: Tor тикшерүне кушылмасы

source: You are using Tor and it looks like you have this external IP address: {ip_address}
tt: Сез Tor'ны кулланасыз һәм, ахрысы, бу тышкы IP адресыгыз бар: {ip_address}

source: You are not using Tor and you have this external IP address: {ip_address}
tt: Сез Tor'ны кулланмыйсыз һәм бу тышкы IP адресыгыз бар: {ip_address}

source: Tracker URL remover
tt: Сылтама күзәтүне бетерү

source: Page not found
tt: Сәхифә табылмады

source: search page
tt: эзләү сылтамасы

source: Donate
tt: Иганә итү

source: Preferences
tt: Көйләүләр

source: Powered by
tt: Эшләүче

source: a privacy-respecting, open metasearch engine
tt: шәхсилекне хөрмәтләүче, ачык метаэзләгеч

source: Source code
tt: Чыганак коды

source: Issue tracker
tt: Мәсьәлә турында хәбәрләү

source: Engine stats
tt: Эзләгәч статистикасы

source: Privacy policy
tt: Шәхсилек сәясәте

source: Length
tt: Озынлык

source: Views
tt: Карау

source: Author
tt: Автор

source: cached
tt: кәшләнгән

source: proxied
tt: проксиләнгән

source: Please check for existing bugs about this engine on GitHub
tt: Бу эзләгеч булучы хаталарын GitHub'та тикшерегезче

source: I confirm there is no existing bug about the issue I encounter
tt: Очракан мәсьәлә бәйле хата булмаганын мин раслыйм

source: No HTTPS
tt: HTTPS'сыз

source: !bang for this engine
tt: Бу эзләгеч өчен !bang

source: !bang for its categories
tt: Аның категорияләр өчен !bang

source: Errors:
tt: Хаталар:

source: General
tt: Гомуми

source: Default categories
tt: Беренчел категорияләр

source: User interface
tt: Кулланучы интерфәйсе

source: Privacy
tt: Шәхсилек

source: Engines
tt: Эзләгечләр

source: Currently used search engines
tt: Кулланылучы эзләгечләр

source: Special Queries
tt: Махсус сораулар

source: Answers
tt: Җаваплар

source: Number of results
tt: Нәтиҗә саны

source: Info
tt: Мәгълүмат

source: Try searching for:
tt: Эзләп карагыз:

source: Back to top
tt: Өскә

source: Previous page
tt: Элеккеге бит

source: Next page
tt: Киләсе бит

source: Search for...
tt: Эзләү...

source: clear
tt: чистарту

source: search
tt: эзләү

source: Engine name
tt: Эзләгеч исеме

source: Result count
tt: Нәтиҗә саны

source: Response time
tt: Җавап вакыты

source: Message
tt: Хәбәр

source: Percentage
tt: Процент

source: Parameter
tt: Параметр

source: Filename
tt: Файл исеме

source: Function
tt: Функция

source: Code
tt: Код

source: Messages from the search engines
tt: Эзләгечләрдән хәбәр

source: seconds
tt: секунд

source: Search URL
tt: Эзләү сылтамасы

source: Copied
tt: Күчереп алынды

source: Copy
tt: Күчереп алу

source: Suggestions
tt: Тәкъдимнәр

source: Search language
tt: Эзләү теле

source: Default language
tt: Беренчел тел

source: Auto-detect
tt: Авто-билгеләү

source: SafeSearch
tt: Имин эзләү

source: Strict
tt: Каты

source: Moderate
tt: Уртача

source: None
tt: Сүнек

source: Time range
tt: Вакыт арасы

source: Anytime
tt: Теләсә вакыт

source: Last day
tt: Соңгы көн

source: Last week
tt: Соңгы атна

source: Last month
tt: Соңгы ай

source: Last year
tt: Соңгы ел

source: Information!
tt: Мәгълүмат!

source: Sorry!
tt: Гафу итегез!

source: No results were found. You can try to:
tt: Нәтиҗәләр табылмады. Сез тырышып карый аласыз:

source: There are no more results. You can try to:
tt: Артык нәтиҗәләр юк. Сез тырышып карый аласыз:

source: Search for another query or select another category (above).
tt: Башка сорау кулланып эзләгез яки башка категорияне (өстә) сайлагыз.

source: Change the search engine used in the preferences:
tt: Көйләүләрдә сайланган эзләгечне үзгәртегез:

source: Search for another query or select another category.
tt: Башка сорау кулланып эзләгез яки башка категорияне сайлагыз.

source: Allow
tt: Рөхсәт бирү

source: Name
tt: Исем

source: Description
tt: Тасвирлама

source: Examples
tt: Мисал

source: This is the list of plugins.
tt: Бу — кушылма исемлеге.

source: Autocomplete
tt: Автотәмамлану

source: Cookie name
tt: Cookie исеме

source: Value
tt: Кыйммәт

source: Enable all
tt: Барлыкны кушу

source: Disable all
tt: Барлыкны сүндерү

source: Save
tt: Саклау

source: Reset defaults
tt: Әүвәлге

source: Back
tt: Артка

source: Image proxy
tt: Сурәт өчен прокси

source: What language do you prefer for search?
tt: Эзләү өчен сез нинди телне яхшырак табасыз?

source: Theme
tt: Тема

source: Theme style
tt: Тема стиле

source: Engine tokens
tt: Эзләгеч токеннары

source: Access tokens for private engines
tt: Шәхси эзләгеч өчен рөхсәт токеннары

source: Interface language
tt: Интерфәйс теле

source: Change the language of the layout
tt: Интерфәйс телен үзгәртү

source: show media
tt: медианы күрсәтү

source: hide media
tt: медианы яшерү

source: This site did not provide any description.
tt: Бу сайт тасвирламаны бирмәде.

source: Filesize
tt: Файл зурлыгы

source: Date
tt: Дата

source: Type
tt: Төр

source: Resolution
tt: Ачыклык

source: Format
tt: Формат

source: Engine
tt: Эзләгеч

source: View source
tt: Чыганакка үтү

source: address
tt: адрес

source: show map
tt: хаританы күрсәтү

source: hide map
tt: хаританы яшерү

source: Version
tt: Версия

source: Updated at
tt: Яңарту вакыты

source: Tags
tt: Тәгләр

source: Popularity
tt: Популярлык

source: License
tt: Лицензия

source: Project
tt: Проект

source: Project homepage
tt: Проект сәхифәсе

source: magnet link
tt: magnet сылтамасы

source: torrent file
tt: торрент файлы

source: Number of Files
tt: Файл саны

source: show video
tt: видеоны күрсәтү

source: hide video
tt: видеоны яшерү
